In [1]:
# this instruction is used to import the library pandas so we can use it later
# "as pd" means that we can use the term pd to use the library instead of typing pandas
import pandas as pd

In [2]:
# .read_csv is an input method used to read csv files (datasets)
# remember we use pd instead of pandas 
# Also make sure that both files (the notebook and the dataset) are in the same folder
# otherwise, you will need to provide the full path instead of just the name of the dataset
salaries = pd.read_csv("Salaries.csv", low_memory=False)

In [3]:
# .head(5) will return the first five lines of the dataset
salaries.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
# .tail(3) will return the last 3 lines of the dataset
salaries.tail(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [5]:
# the function type will indicate the type of the variable between parantheses
type(salaries.TotalPay)

pandas.core.series.Series

In [6]:
# the method .values will allow to access the values as an ndarray instead of a series
type(salaries["TotalPay"].values)

numpy.ndarray

In [7]:
# .values[0] will allow access to access the first value of the ndarray, if needed of course
print(salaries["TotalPay"].values[0])

567595.43

In [8]:
# .shape will return the shape of the dataset
# for example, in this dataset, we have 148654 rows (or instances) and 13 columns (or features)
salaries.shape

(148654, 13)

In [9]:
# .columns is a property that will return a list with all the columns of the dataset
salaries.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [10]:
# .info() is a method that will return a small description of the columns of the dataset
# such as the title of the columns, the type, the count, how many Null values, etc.
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [11]:
# .describe() is a method that will return some Descriptive Statistics values, such as the mean, std. etc.
salaries.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [12]:
# this line will allow us to create a new dataset, a subdataset, from a specific list of features
# for example, this will select all the features from JobTitle to TotalPayBenefits
subDataset = salaries.loc[: , "JobTitle":"TotalPayBenefits"]
subDataset

,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits
0,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43
1,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28
2,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91
3,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61
4,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19
...,...,...,...,...,...,...,...
148649,Custodian,0.00,0.00,0.00,0.00,0.00,0.00
148650,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00
148651,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00
148652,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00
148653,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13

In [13]:
# then the new subdataset can be used for further analysis
subDataset.head()

,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits
0,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43
1,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28
2,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91
3,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61
4,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19

In [14]:
# this will allow to create a new subdataset, but with a limited number of instances
# for example, here we are selecting all instance where the salary has been recorded in 2014
# .Year == 2014
latest_salaries = salaries[salaries.Year == 2014]

In [15]:
# then again we can use the new subdataset for further analysis
# for example, to print the mean of the TotalPay for 2014
print(latest_salaries.TotalPay.mean())

75463.91814023

In [16]:
# we can also print the max
print(latest_salaries.TotalPay.max())

471952.64

In [17]:
# of course we can call the method .describe() for this new subdataset
latest_salaries.describe()

                  Id       TotalPay  TotalPayBenefits     Year  Notes
count   38123.000000   38123.000000      38123.000000  38123.0    0.0
mean   129593.000000   75463.918140     100250.918884   2014.0    NaN
std     11005.306493   51697.713029      66238.852887      0.0    NaN
min    110532.000000    -618.130000       -618.130000   2014.0    NaN
25%    120062.500000   33436.210000      44199.990000   2014.0    NaN
50%    129593.000000   72359.980000     101105.370000   2014.0    NaN
75%    139123.500000  107974.445000     142746.950000   2014.0    NaN
max    148654.000000  471952.640000     510732.680000   2014.0    NaN